{"class":{"name":"Paladin","source":"PHB","page":82,"srd":true,"hd":{"number":1,"faces":10},"proficiency":["wis","cha"],"spellcastingAbility":"cha","casterProgression":"1/2","startingProficiencies":{"armor":["light","medium","heavy","shields"],"weapons":["simple","martial"],"skills":[{"choose":{"from":["athletics","insight","intimidation","medicine","persuasion","religion"],"count":2}}]},"startingEquipment":{"additionalFromBackground":true,"default":["(a) a {@filter martial weapon|items|source=phb|category=basic|type=martial weapon} and a {@item shield|phb} or (b) two {@filter martial weapons|items|source=phb|category=basic|type=martial weapon}","(a) five {@item javelin|phb|javelins} or (b) any {@filter simple melee weapon|items|source=phb|category=basic|type=simple weapon;melee weapon=sand}","(a) a {@item priest's pack|phb} or (b) an {@item explorer's pack|phb}","{@item Chain mail|phb} and a {@item holy symbol|phb}"],"goldAlternative":"{@dice 5d4 × 10|5d4 × 10|Starting Gold}","defaultData":[{"a":[{"equipmentType":"weaponMartial"},"shield|phb"],"b":[{"equipmentType":"weaponMartial","quantity":2}]},{"a":[{"item":"javelin|phb","quantity":5}],"b":[{"equipmentType":"weaponSimpleMelee"}]},{"a":["priest's pack|phb"],"b":["explorer's pack|phb"]},{"_":["Chain mail|phb","holy symbol|phb"]}]},"multiclassing":{"requirements":{"str":13,"cha":13},"proficienciesGained":{"armor":["light","medium","shields"],"weapons":["simple","martial"]}},"classTableGroups":[{"title":"Spell Slots per Spell Level","colLabels":["{@filter 1st|spells|level=1|class=Paladin}","{@filter 2nd|spells|level=2|class=Paladin}","{@filter 3rd|spells|level=3|class=Paladin}","{@filter 4th|spells|level=4|class=Paladin}","{@filter 5th|spells|level=5|class=Paladin}"],"rows":[[0,0,0,0,0],[2,0,0,0,0],[3,0,0,0,0],[3,0,0,0,0],[4,2,0,0,0],[4,2,0,0,0],[4,3,0,0,0],[4,3,0,0,0],[4,3,2,0,0],[4,3,2,0,0],[4,3,3,0,0],[4,3,3,0,0],[4,3,3,1,0],[4,3,3,1,0],[4,3,3,2,0],[4,3,3,2,0],[4,3,3,3,1],[4,3,3,3,1],[4,3,3,3,2],[4,3,3,3,2]]}],"classFeatures":["Divine Sense|Paladin||1","Lay on Hands|Paladin||1","Divine Smite|Paladin||2","Fighting Style|Paladin||2","Martial Versatility|Paladin||2|UAClassFeatureVariants","Spellcasting|Paladin||2","Divine Health|Paladin||3",{"classFeature":"Sacred Oath|Paladin||3","gainSubclassFeature":true},"Ability Score Improvement|Paladin||4","Proficiency Versatility|Paladin||4|UAClassFeatureVariants","Martial Versatility|Paladin||4|TCE","Extra Attack|Paladin||5","Aura of Protection|Paladin||6",{"classFeature":"Sacred Oath feature|Paladin||7","gainSubclassFeature":true},"Ability Score Improvement|Paladin||8","Proficiency Versatility|Paladin||8|UAClassFeatureVariants","Aura of Courage|Paladin||10","Improved Divine Smite|Paladin||11","Ability Score Improvement|Paladin||12","Proficiency Versatility|Paladin||12|UAClassFeatureVariants","Cleansing Touch|Paladin||14",{"classFeature":"Sacred Oath feature|Paladin||15","gainSubclassFeature":true},"Ability Score Improvement|Paladin||16","Proficiency Versatility|Paladin||16|UAClassFeatureVariants","Aura improvements|Paladin||18","Ability Score Improvement|Paladin||19","Proficiency Versatility|Paladin||19|UAClassFeatureVariants",{"classFeature":"Sacred Oath feature|Paladin||20","gainSubclassFeature":true}],"subclassTitle":"Sacred Oath","subclasses":[{"name":"Oath of Devotion","shortName":"Devotion","source":"PHB","page":85,"srd":true,"additionalSpells":[{"prepared":{"3":["protection from evil and good","sanctuary"],"5":["lesser restoration","zone of truth"],"9":["beacon of hope","dispel magic"],"13":["freedom of movement","guardian of faith"],"17":["commune","flame strike"]}}],"subclassFeatures":["Oath of Devotion|Paladin||Devotion||3","Aura of Devotion|Paladin||Devotion||7","Purity of Spirit|Paladin||Devotion||15","Holy Nimbus|Paladin||Devotion||20"]}],"fluff":[{"name":"Paladin","type":"section","entries":["Clad in plate armor that gleams in the sunlight despite the dust and grime of long travel, a human lays down her sword and shield and places her hands on a mortally wounded man. Divine radiance shines from her hands, the man's wounds knit closed, and his eyes open wide with amazement.","A dwarf crouches behind an outcrop, his black cloak making him nearly invisible in the night, and watches an orc war band celebrating its recent victory. Silently, he stalks into their midst and whispers an oath, and two orcs are dead before they even realize he is there.","Silver hair shining in a shaft of light that seems to illuminate only him, an elf laughs with exultation. His spear flashes like his eyes as he jabs again and again at a twisted giant, until at last his light overcomes its hideous darkness.","Whatever their origin and their mission, paladins are united by their oaths to stand against the forces of evil. Whether sworn before a god's altar and the witness of a priest, in a sacred glade before nature spirits and fey beings, or in a moment of desperation and grief with the dead as the only witness, a paladin's oath is a powerful bond. It is a source of power that turns a devout warrior into a blessed champion.",{"type":"entries","name":"The Cause of Righteousness","entries":["A paladin swears to uphold justice and righteousness, to stand with the good things of the world against the encroaching darkness, and to hunt the forces of evil wherever they lurk. Different paladins focus on various aspects of the cause of righteousness, but all are bound by the oaths that grant them power to do their sacred work. Although many paladins are devoted to gods of good, a paladin's power comes as much from a commitment to justice itself as it does from a god.","Paladins train for years to learn the skills of combat, mastering a variety of weapons and armor. Even so, their martial skills are secondary to the magical power they wield: power to heal the sick and injured, to smite the wicked and the undead, and to protect the innocent and those who join them in the fight for justice."]},{"type":"entries","name":"Beyond the Mundane Life","entries":["Almost by definition, the life of a paladin is an adventuring life. Unless a lasting injury has taken him or her away from adventuring for a time, every paladin lives on the front lines of the cosmic struggle against evil. Fighters are rare enough among the ranks of the militias and armies of the world, but even fewer people can claim the true calling of a paladin. When they do receive the call, these warriors turn from their former occupations and take up arms to fight evil. Sometimes their oaths lead them into the service of the crown as leaders of elite groups of knights, but even then their loyalty is first to the cause of righteousness, not to crown and country.","Adventuring paladins take their work seriously. A delve into an ancient ruin or dusty crypt can be a quest driven by a higher purpose than the acquisition of treasure. Evil lurks in dungeons and primeval forests, and even the smallest victory against it can tilt the cosmic balance away from oblivion."]},{"type":"entries","name":"Creating a Paladin","entries":["The most important aspect of a paladin character is the nature of his or her holy quest. Although the class features related to your oath don't appear until you reach 3rd level, plan ahead for that choice by reading the oath descriptions at the end of the class. Are you a devoted servant of good, loyal to the gods of justice and honor, a holy knight in shining armor venturing forth to smite evil? Are you a glorious champion of the light, cherishing everything beautiful that stands against the shadow, a knight whose oath descends from traditions older than many of the gods? Or are you an embittered loner sworn to take vengeance on those who have done great evil, sent as an angel of death by the gods or driven by your need for revenge? Appendix B lists many deities worshiped by paladins throughout the multiverse, such as Torm, Tyr, Heironeous, Paladine, Kiri-Jolith, Dol Arrah, the Silver Flame, Bahamut, Athena, Re-Horakhty, and Heimdall.","How did you experience your call to serve as a paladin? Did you hear a whisper from an unseen god or angel while you were at prayer? Did another paladin sense the potential within you and decide to train you as a squire? Or did some terrible event—the destruction of your home, perhaps—drive you to your quests? Perhaps you stumbled into a sacred grove or a hidden elven enclave and found yourself called to protect all such refuges of goodness and beauty. Or you might have known from your earliest memories that the paladin's life was your calling, almost as if you had been sent into the world with that purpose stamped on your soul.","As guardians against the forces of wickedness, paladins are rarely of any evil alignment. Most of them walk the paths of charity and justice. Consider how your alignment colors the way you pursue your holy quest and the manner in which you conduct yourself before gods and mortals. Your oath and alignment might be in harmony, or your oath might represent standards of behavior that you have not yet attained.",{"type":"entries","name":"Quick Build","entries":["You can make a paladin quickly by following these suggestions. First, Strength should be your highest ability score, followed by Charisma. Second, choose the {@background noble} background."]}]}],"page":82,"source":"PHB"},{"type":"section","entries":[{"type":"quote","entries":["The true worth of a paladin is measured not in foes defeated or dungeons plundered. It is measured in lives saved and hearts turned to the causes of mercy and justice."],"by":"Isteval"},"A paladin is a living embodiment of an oath—a promise or a vow made manifest in the person of a holy warrior who has the skill and the determination to see the cause through to the end. Some paladins devote themselves expressly to protecting the innocent and spreading justice in the world, while others resolve to attain that goal by conquering those who stand defiant and bringing them under the rule of law.","Although no paladin in the world could be described as typical, a number of them are narrow-minded do-gooders who refuse to tolerate even the smallest deviation from their own outlook. Paladins who take up the adventuring life, however, rarely remain so rigid in their attitudes—if only to keep from alienating their companions.","You can flesh out your paladin character by using the suggestions below. It's important to keep in mind that most paladins aren't robots. They have doubts and prejudices and harbor contradictory thoughts just as any other character does. Some are compelled by an internal motivation that might sometimes be at odds with the principles of their oaths.",{"type":"entries","name":"Personal Goal","entries":["The precepts of a paladin's oath provide purpose to the character and dictate an ultimate goal or an overall intent that the paladin abides by and advances. Aside from that, some paladins are driven by a personal goal that either complements or transcends the dictates of their oaths. Paladins who swear different oaths might have the same personal goal, differing only in how they apply that goal to their actions when upholding their oaths.","If your paladin character has a personal goal, it might be drawn from some life event and thus not directly tied to the oath.",{"type":"table","caption":"Personal Goal","colLabels":["{@dice d6}","Personal Goal"],"colStyles":["col-1 text-center","col-11"],"rows":[[{"type":"cell","roll":{"exact":1}},"Peace. You fight so that future generations will not have to."],[{"type":"cell","roll":{"exact":2}},"Revenge. Your oath is the vehicle through which you will right an ancient wrong."],[{"type":"cell","roll":{"exact":3}},"Duty. You will live up to what you have sworn to do, or die trying."],[{"type":"cell","roll":{"exact":4}},"Leadership. You will win a great battle that bards will sing about, and in so doing, you will become an example to inspire others."],[{"type":"cell","roll":{"exact":5}},"Faith. You know your path is righteous, or else the gods would not have set you upon it."],[{"type":"cell","roll":{"exact":6}},"Glory. You will lead the world into a grand new era, one that will be branded with your name."]]}]},{"type":"entries","name":"Symbol","entries":["Paladins are mindful of the influence of symbols, and many of them adopt or design an artistic device that bears a distinctive image. Your symbol exemplifies the oath you have taken and communicates that message to those around you, friend and foe alike.","Your symbol might be displayed on a banner, a flag, or your clothing for all to see. Or it could be less obvious, such as a trinket or a token that you carry concealed on your person.",{"type":"table","caption":"Symbol","colLabels":["{@dice d6}","Symbol"],"colStyles":["col-1 text-center","col-11"],"rows":[[{"type":"cell","roll":{"exact":1}},"A dragon, emblematic of your nobility in peace and your ferocity in combat"],[{"type":"cell","roll":{"exact":2}},"A clenched fist, because you are always ready to fight for your beliefs"],[{"type":"cell","roll":{"exact":3}},"An upraised open hand, indicating your preference for diplomacy over combat"],[{"type":"cell","roll":{"exact":4}},"A red heart, showing the world your commitment to justice"],[{"type":"cell","roll":{"exact":5}},"A black heart, signifying that emotions such as pity do not sway your dedication to your oath"],[{"type":"cell","roll":{"exact":6}},"An unblinking eye, meaning that you are ever alert to all threats against your cause"]]}]},{"type":"entries","name":"Nemesis","entries":["Their adherence to a sacred oath demands that paladins take an active stance in carrying their beliefs into the world. This activity naturally leads to conflict with creatures or entities that oppose those beliefs. Among those opponents, one often stands out as a paladin's most persistent or most formidable foe—a nemesis whose presence or influence is a constant factor in a paladin's life.","Your paladin character might have an enemy that dates from the days before you took up your path. Or you could be a target because when you became a paladin, you immediately attracted the attention of those that would do you in. If you have a nemesis, who or what is it? Whom among your enemies do you consider to be the biggest threat to achieving your goals?",{"type":"table","caption":"Nemesis","colLabels":["{@dice d6}","Nemesis"],"colStyles":["col-1 text-center","col-11"],"rows":[[{"type":"cell","roll":{"exact":1}},"A mighty orc war chief who threatens to overrun and destroy everything you hold sacred"],[{"type":"cell","roll":{"exact":2}},"A fiend or a celestial, the agent of a power of the Outer Planes, who has been charged with corrupting or redeeming you, as appropriate"],[{"type":"cell","roll":{"exact":3}},"A dragon whose servants dog your steps"],[{"type":"cell","roll":{"exact":4}},"A high priest who sees you as a misguided fool and wants you to abandon your religion"],[{"type":"cell","roll":{"exact":5}},"A rival paladin who trained with you but became an oath-breaker and holds you responsible"],[{"type":"cell","roll":{"exact":6}},"A vampire who has sworn revenge against all paladins after being defeated by one"]]}]},{"type":"entries","name":"Temptation","entries":["Although paladins are dedicated to their oaths, they are mortals, and thus they are flawed. Many of them exhibit a type of behavior or hold to an attitude that is not in keeping with the highest ideals of their calling.","What is the temptation that your character succumbs to or finds it difficult to resist?",{"type":"table","caption":"Temptation","colLabels":["{@dice d6}","Temptation"],"colStyles":["col-1 text-center","col-11"],"rows":[[{"type":"cell","roll":{"exact":1}},"Fury. When your anger is roused, you have trouble thinking straight, and you fear you might do something you'll regret."],[{"type":"cell","roll":{"exact":2}},"Pride. Your deeds are noteworthy, and no one takes note of them more often than you."],[{"type":"cell","roll":{"exact":3}},"Lust. You can't resist an attractive face and a pleasant smile."],[{"type":"cell","roll":{"exact":4}},"Envy. You are mindful of what some famous folk have accomplished, and you feel inadequate when your deeds don't compare to theirs."],[{"type":"cell","roll":{"exact":5}},"Despair. You consider the great strength of the enemies you must defeat, and at times you see no way to achieve final victory."],[{"type":"cell","roll":{"exact":6}},"Greed. Regardless of how much glory and treasure you amass, it's never enough for you."]]}]}],"source":"XGE","page":36}]},"classFeature":[{"name":"Divine Sense","source":"PHB","page":82,"srd":true,"className":"Paladin","classSource":"PHB","level":1,"entries":["The presence of strong evil registers on your senses like a noxious odor, and powerful good rings like heavenly music in your ears. As an action, you can open your awareness to detect such forces. Until the end of your next turn, you know the location of any celestial, fiend, or undead within 60 feet of you that is not behind total cover. You know the type (celestial, fiend, or undead) of any being whose presence you sense, but not its identity (the vampire Count Strahd von Zarovich, for instance). Within the same radius, you also detect the presence of any place or object that has been consecrated or desecrated, as with the {@spell hallow} spell.","You can use this feature a number of times equal to 1 + your Charisma modifier. When you finish a long rest, you regain all expended uses."]},{"name":"Lay on Hands","source":"PHB","page":82,"srd":true,"className":"Paladin","classSource":"PHB","level":1,"entries":["Your blessed touch can heal wounds. You have a pool of healing power that replenishes when you take a long rest. With that pool, you can restore a total number of hit points equal to your paladin level × 5.","As an action, you can touch a creature and draw power from the pool to restore a number of hit points to that creature, up to the maximum amount remaining in your pool.","Alternatively, you can expend 5 hit points from your pool of healing to cure the target of one disease or neutralize one poison affecting it. You can cure multiple diseases and neutralize multiple poisons with a single use of Lay on Hands, expending hit points separately for each one.","This feature has no effect on undead and constructs."]},{"name":"Divine Smite","source":"PHB","page":82,"srd":true,"className":"Paladin","classSource":"PHB","level":2,"entries":["Starting at 2nd level, when you hit a creature with a melee weapon attack, you can expend one spell slot to deal radiant damage to the target, in addition to the weapon's damage. The extra damage is {@dice 2d8} for a 1st-level spell slot, plus {@dice 1d8} for each spell level higher than 1st, to a maximum of {@dice 5d8}. The damage increases by {@dice 1d8} if the target is an undead or a fiend, to a maximum of {@dice 6d8}."]},{"name":"Fighting Style","source":"PHB","page":82,"srd":true,"className":"Paladin","classSource":"PHB","level":2,"entries":["At 2nd level, you adopt a particular style of fighting as your specialty. Choose one of the following options. You can't take the same Fighting Style option more than once, even if you get to choose again.",{"type":"options","count":1,"entries":[{"type":"refOptionalfeature","optionalfeature":"Close Quarters Shooter|UALightDarkUnderdark"},{"type":"refOptionalfeature","optionalfeature":"Defense"},{"type":"refOptionalfeature","optionalfeature":"Dueling"},{"type":"refOptionalfeature","optionalfeature":"Great Weapon Fighting"},{"type":"refOptionalfeature","optionalfeature":"Mariner|UAWaterborneAdventures"},{"type":"refOptionalfeature","optionalfeature":"Protection"},{"type":"refOptionalfeature","optionalfeature":"Tunnel Fighter|UALightDarkUnderdark"},{"type":"refOptionalfeature","optionalfeature":"Blind Fighting|UAClassFeatureVariants"},{"type":"refOptionalfeature","optionalfeature":"Interception|UAClassFeatureVariants"},{"type":"refOptionalfeature","optionalfeature":"Thrown Weapon Fighting|UAClassFeatureVariants"},{"type":"refOptionalfeature","optionalfeature":"Unarmed Fighting|UAClassFeatureVariants"},{"type":"refOptionalfeature","optionalfeature":"Blessed Warrior|UAClassFeatureVariants"},{"type":"refOptionalfeature","optionalfeature":"Blessed Warrior|TCE"},{"type":"refOptionalfeature","optionalfeature":"Blind Fighting|TCE"},{"type":"refOptionalfeature","optionalfeature":"Interception|TCE"}]}]},{"name":"Spellcasting","source":"PHB","page":82,"srd":true,"className":"Paladin","classSource":"PHB","level":2,"entries":["By 2nd level, you have learned to draw on divine magic through meditation and prayer to cast spells as a cleric does. See {@book chapter 10|PHB|10} for the general rules of spellcasting and {@book chapter 11|PHB|11} for the {@filter paladin spell list|spells|class=paladin}.",{"type":"entries","name":"Preparing and Casting Spells","entries":["The Paladin table shows how many spell slots you have to cast your {@filter paladin spells|spells|class=paladin}. To cast one of your paladin spells of 1st level or higher, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.","You prepare the list of paladin spells that are available for you to cast, choosing from the paladin spell list. When you do so, choose a number of paladin spells equal to your Charisma modifier + half your paladin level, rounded down (minimum of one spell). The spells must be of a level for which you have spell slots.","For example, if you are a 5th-level paladin, you have four 1st-level and two 2nd-level spell slots. With a Charisma of 14, your list of prepared spells can include four spells of 1st or 2nd-level, in any combination. If you prepare the 1st-level spell {@spell cure wounds}, you can cast it using a 1st-level or a 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.","You can change your list of prepared spells when you finish a long rest. Preparing a new list of paladin spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list."]},{"type":"entries","name":"Spellcasting Ability","entries":["Charisma is your spellcasting ability for your paladin spells, since their power derives from the strength of your convictions. You use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a paladin spell you cast and when making an attack roll with one.",{"type":"abilityDc","name":"Spell","attributes":["cha"]},{"type":"abilityAttackMod","name":"Spell","attributes":["cha"]}]},{"type":"entries","name":"Spellcasting Focus","entries":["You can use a {@item holy symbol|phb} as a spellcasting focus for your paladin spells."]}]},{"name":"Divine Health","source":"PHB","page":82,"srd":true,"className":"Paladin","classSource":"PHB","level":3,"entries":["By 3rd level, the divine magic flowing through you makes you immune to disease."]},{"name":"Sacred Oath","source":"PHB","page":82,"srd":true,"className":"Paladin","classSource":"PHB","level":3,"entries":["When you reach 3rd level, you swear the oath that binds you as a paladin forever. Up to this time you have been in a preparatory stage, committed to the path but not yet sworn to it. Now you choose from the list of available oaths.","Your choice grants you features at 3rd level and again at 7th, 15th, and 20th level. Those features include oath spells and the Channel Divinity feature.",{"name":"Oath Spells","type":"entries","entries":["Each oath has a list of associated spells. You gain access to these spells at the levels specified in the oath description. Once you gain access to an oath spell, you always have it prepared. Oath spells don't count against the number of spells you can prepare each day.","If you gain an oath spell that doesn't appear on the paladin spell list, the spell is nonetheless a paladin spell for you."]},{"name":"Channel Divinity","type":"entries","entries":["Your oath allows you to channel divine energy to fuel magical effects. Each Channel Divinity option provided by your oath explains how to use it.","When you use your Channel Divinity, you choose which option to use. You must then finish a short or long rest to use your Channel Divinity again.","Some Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your paladin spell save DC."]},{"type":"refClassFeature","classFeature":"Channel Divinity: Harness Divine Power|Paladin||3|UAClassFeatureVariants"},{"type":"refClassFeature","classFeature":"Channel Divinity: Harness Divine Power|Paladin||3|TCE"},{"name":"Breaking Your Oath","type":"inset","entries":["A paladin tries to hold to the highest standards of conduct, but even the most virtuous paladin is fallible. Sometimes the right path proves too demanding, sometimes a situation calls for the lesser of two evils, and sometimes the heat of emotion causes a paladin to transgress his or her oath.","A paladin who has broken a vow typically seeks absolution from a cleric who shares his or her faith or from another paladin of the same order. The paladin might spend an all-night vigil in prayer as a sign of penitence, or undertake a fast or similar act of self-denial. After a rite of confession and forgiveness, the paladin starts fresh.","If a paladin willfully violates his or her oath and shows no sign of repentance, the consequences can be more serious. At the DM's discretion, an impenitent paladin might be forced to abandon this class and adopt another, or perhaps to take the Oathbreaker paladin option that appears in the Dungeon Master's Guide."]}]},{"name":"Ability Score Improvement","source":"PHB","page":82,"srd":true,"className":"Paladin","classSource":"PHB","level":4,"entries":["When you reach 4th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.","If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."]},{"name":"Extra Attack","source":"PHB","page":82,"srd":true,"className":"Paladin","classSource":"PHB","level":5,"entries":["Beginning at 5th level, you can attack twice, instead of once, whenever you take the {@action Attack} action on your turn."]},{"name":"Aura of Protection","source":"PHB","page":82,"srd":true,"className":"Paladin","classSource":"PHB","level":6,"entries":["Starting at 6th level, whenever you or a friendly creature within 10 feet of you must make a saving throw, the creature gains a bonus to the saving throw equal to your Charisma modifier (with a minimum bonus of +1). You must be conscious to grant this bonus.","At 18th level, the range of this aura increases to 30 feet."]},{"name":"Sacred Oath feature","source":"PHB","page":82,"srd":true,"className":"Paladin","classSource":"PHB","level":7,"entries":["At 7th level, you gain a feature granted to you by your Sacred Oath."]},{"name":"Ability Score Improvement","source":"PHB","page":82,"srd":true,"className":"Paladin","classSource":"PHB","level":8,"entries":["When you reach 8th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.","If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."]},{"name":"Aura of Courage","source":"PHB","page":82,"srd":true,"className":"Paladin","classSource":"PHB","level":10,"entries":["Starting at 10th level, you and friendly creatures within 10 feet of you can't be {@condition frightened} while you are conscious.","At 18th level, the range of this aura increases to 30 feet."]},{"name":"Improved Divine Smite","source":"PHB","page":82,"srd":true,"className":"Paladin","classSource":"PHB","level":11,"entries":["By 11th level, you are so suffused with righteous might that all your melee weapon strikes carry divine power with them. Whenever you hit a creature with a melee weapon, the creature takes an extra {@damage 1d8} radiant damage."]},{"name":"Ability Score Improvement","source":"PHB","page":82,"srd":true,"className":"Paladin","classSource":"PHB","level":12,"entries":["When you reach 12th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.","If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."]},{"name":"Cleansing Touch","source":"PHB","page":82,"srd":true,"className":"Paladin","classSource":"PHB","level":14,"entries":["Beginning at 14th level, you can use your action to end one spell on yourself or on one willing creature that you touch.","You can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain expended uses when you finish a long rest."]},{"name":"Sacred Oath feature","source":"PHB","page":82,"srd":true,"className":"Paladin","classSource":"PHB","level":15,"entries":["At 15th level, you gain a feature granted to you by your Sacred Oath."]},{"name":"Ability Score Improvement","source":"PHB","page":82,"srd":true,"className":"Paladin","classSource":"PHB","level":16,"entries":["When you reach 16th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.","If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."]},{"name":"Aura improvements","source":"PHB","page":82,"srd":true,"className":"Paladin","classSource":"PHB","level":18,"entries":["At 18th level, the range of your Aura of Protection increases to 30 feet."]},{"name":"Ability Score Improvement","source":"PHB","page":82,"srd":true,"className":"Paladin","classSource":"PHB","level":19,"entries":["When you reach 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.","If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."]},{"name":"Sacred Oath feature","source":"PHB","page":82,"srd":true,"className":"Paladin","classSource":"PHB","level":20,"entries":["At 20th level, you gain a feature granted to you by your Sacred Oath."]}],"subclassFeature":[{"name":"Oath of Devotion","source":"PHB","page":85,"srd":true,"className":"Paladin","classSource":"PHB","subclassShortName":"Devotion","subclassSource":"PHB","level":3,"entries":["The Oath of Devotion binds a paladin to the loftiest ideals of justice, virtue, and order. Sometimes called cavaliers, white knights, or holy warriors, these paladins meet the ideal of the knight in shining armor, acting with honor in pursuit of justice and the greater good. They hold themselves to the highest standards of conduct, and some, for better or worse, hold the rest of the world to the same standards. Many who swear this oath are devoted to gods of law and good and use their gods' tenets as the measure of their devotion. They hold angels—the perfect servants of good—as their ideals, and incorporate images of angelic wings into their helmets or coats of arms.",{"type":"refSubclassFeature","subclassFeature":"Tenets of Devotion|Paladin||Devotion||3"},{"type":"refSubclassFeature","subclassFeature":"Oath Spells|Paladin||Devotion||3"},{"type":"refSubclassFeature","subclassFeature":"Channel Divinity: Sacred Weapon|Paladin||Devotion||3"},{"type":"refSubclassFeature","subclassFeature":"Channel Divinity: Turn the Unholy|Paladin||Devotion||3"}]},{"name":"Channel Divinity: Sacred Weapon","source":"PHB","page":85,"srd":true,"className":"Paladin","classSource":"PHB","subclassShortName":"Devotion","subclassSource":"PHB","level":3,"header":1,"entries":["As an action, you can imbue one weapon that you are holding with positive energy, using your Channel Divinity. For 1 minute, you add your Charisma modifier to attack rolls made with that weapon (with a minimum bonus of +1). The weapon also emits bright light in a 20-foot radius and dim light 20 feet beyond that. If the weapon is not already magical, it becomes magical for the duration.","You can end this effect on your turn as part of any other action. If you are no longer holding or carrying this weapon, or if you fall {@condition unconscious}, this effect ends."]},{"name":"Channel Divinity: Turn the Unholy","source":"PHB","page":85,"srd":true,"className":"Paladin","classSource":"PHB","subclassShortName":"Devotion","subclassSource":"PHB","level":3,"header":1,"entries":["As an action, you present your holy symbol and speak a prayer censuring fiends and undead, using your Channel Divinity. Each fiend or undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes damage.","A turned creature must spend its turns trying to move as far away from you as it can, and it can't willingly move to a space within 30 feet of you. It also can't take reactions. For its action, it can use only the {@action Dash} action or try to escape from an effect that prevents it from moving. If there's nowhere to move, the creature can use the {@action Dodge} action."]},{"name":"Oath Spells","source":"PHB","page":85,"srd":true,"className":"Paladin","classSource":"PHB","subclassShortName":"Devotion","subclassSource":"PHB","level":3,"header":1,"entries":["You gain oath spells at the paladin levels listed.",{"type":"table","caption":"Oath of Devotion Spells","colLabels":["Paladin Level","Spells"],"colStyles":["col-2 text-center","col-10"],"rows":[["3rd","{@spell protection from evil and good}, {@spell sanctuary}"],["5th","{@spell lesser restoration}, {@spell zone of truth}"],["9th","{@spell beacon of hope}, {@spell dispel magic}"],["13th","{@spell freedom of movement}, {@spell guardian of faith}"],["17th","{@spell commune}, {@spell flame strike}"]]}]},{"name":"Tenets of Devotion","source":"PHB","page":85,"srd":true,"className":"Paladin","classSource":"PHB","subclassShortName":"Devotion","subclassSource":"PHB","level":3,"header":1,"entries":["Though the exact words and strictures of the Oath of Devotion vary, paladins of this oath share these tenets.",{"type":"entries","entries":[{"type":"entries","name":"Honesty","entries":["Don't lie or cheat. Let your word be your promise."]}]},{"type":"entries","entries":[{"type":"entries","name":"Courage","entries":["Never fear to act, though caution is wise."]}]},{"type":"entries","entries":[{"type":"entries","name":"Compassion","entries":["Aid others, protect the weak, and punish those who threaten them. Show mercy to your foes, but temper it with wisdom."]}]},{"type":"entries","entries":[{"type":"entries","name":"Honor","entries":["Treat others with fairness, and let your honorable deeds be an example to them. Do as much good as possible while causing the least amount of harm."]}]},{"type":"entries","entries":[{"type":"entries","name":"Duty","entries":["Be responsible for your actions and their consequences, protect those entrusted to your care, and obey those who have just authority over you."]}]}]},{"name":"Aura of Devotion","source":"PHB","page":85,"srd":true,"className":"Paladin","classSource":"PHB","subclassShortName":"Devotion","subclassSource":"PHB","level":7,"header":2,"entries":["Starting at 7th level, you and friendly creatures within 10 feet of you can't be {@condition charmed} while you are conscious.","At 18th level, the range of this aura increases to 30 feet."]},{"name":"Purity of Spirit","source":"PHB","page":85,"srd":true,"className":"Paladin","classSource":"PHB","subclassShortName":"Devotion","subclassSource":"PHB","level":15,"header":2,"entries":["Beginning at 15th level, you are always under the effects of a {@spell protection from evil and good} spell."]},{"name":"Holy Nimbus","source":"PHB","page":85,"srd":true,"className":"Paladin","classSource":"PHB","subclassShortName":"Devotion","subclassSource":"PHB","level":20,"header":2,"entries":["At 20th level, as an action, you can emanate an aura of sunlight. For 1 minute, bright light shines from you in a 30-foot radius, and dim light shines 30 feet beyond that.","Whenever an enemy creature starts its turn in the bright light, the creature takes 10 radiant damage.","In addition, for the duration, you have advantage on saving throws against spells cast by fiends or undead.","Once you use this feature, you can't use it again until you finish a long rest."]}]}