{"class":{"name":"Cleric","source":"PHB","page":36,"srd":true,"hd":{"number":1,"faces":8},"proficiency":["wis","cha"],"spellcastingAbility":"wis","casterProgression":"full","startingProficiencies":{"armor":["light","medium","shields"],"weapons":["simple"],"skills":[{"choose":{"from":["history","insight","medicine","persuasion","religion"],"count":2}}]},"startingEquipment":{"additionalFromBackground":true,"default":["(a) a {@item mace|phb} or (b) a {@item warhammer|phb} (if proficient)","(a) {@item scale mail|phb}, (b) {@item leather armor|phb}, or (c) {@item chain mail|phb} (if proficient)","(a) a {@item light crossbow|phb} and {@item Crossbow Bolts (20)|phb|20 bolts} or (b) any {@filter simple weapon|items|source=phb|category=basic|type=simple weapon}","(a) a {@item priest's pack|phb} or (b) an {@item explorer's pack|phb}","A {@item shield|phb} and a {@item holy symbol|phb}"],"goldAlternative":"{@dice 5d4 × 10|5d4 × 10|Starting Gold}","defaultData":[{"a":["mace|phb"],"b":["warhammer|phb"]},{"a":["scale mail|phb"],"b":["leather armor|phb"],"c":["chain mail|phb"]},{"a":["light crossbow|phb","Crossbow Bolts (20)|phb"],"b":[{"equipmentType":"weaponSimple"}]},{"a":["priest's pack|phb"],"b":["explorer's pack|phb"]},{"_":["shield|phb","holy symbol|phb"]}]},"multiclassing":{"requirements":{"wis":13},"proficienciesGained":{"armor":["light","medium","shields"]}},"classTableGroups":[{"colLabels":["{@filter Cantrips Known|spells|level=0|class=Cleric}"],"rows":[[3],[3],[3],[4],[4],[4],[4],[4],[4],[5],[5],[5],[5],[5],[5],[5],[5],[5],[5],[5]]},{"title":"Spell Slots per Spell Level","colLabels":["{@filter 1st|spells|level=1|class=Cleric}","{@filter 2nd|spells|level=2|class=Cleric}","{@filter 3rd|spells|level=3|class=Cleric}","{@filter 4th|spells|level=4|class=Cleric}","{@filter 5th|spells|level=5|class=Cleric}","{@filter 6th|spells|level=6|class=Cleric}","{@filter 7th|spells|level=7|class=Cleric}","{@filter 8th|spells|level=8|class=Cleric}","{@filter 9th|spells|level=9|class=Cleric}"],"rows":[[2,0,0,0,0,0,0,0,0],[3,0,0,0,0,0,0,0,0],[4,2,0,0,0,0,0,0,0],[4,3,0,0,0,0,0,0,0],[4,3,2,0,0,0,0,0,0],[4,3,3,0,0,0,0,0,0],[4,3,3,1,0,0,0,0,0],[4,3,3,2,0,0,0,0,0],[4,3,3,3,1,0,0,0,0],[4,3,3,3,2,0,0,0,0],[4,3,3,3,2,1,0,0,0],[4,3,3,3,2,1,0,0,0],[4,3,3,3,2,1,1,0,0],[4,3,3,3,2,1,1,0,0],[4,3,3,3,2,1,1,1,0],[4,3,3,3,2,1,1,1,0],[4,3,3,3,2,1,1,1,1],[4,3,3,3,3,1,1,1,1],[4,3,3,3,3,2,1,1,1],[4,3,3,3,3,2,2,1,1]]}],"classFeatures":["Spellcasting|Cleric||1","Cantrip Versatility|Cleric||1|UAClassFeatureVariants",{"classFeature":"Divine Domain|Cleric||1","gainSubclassFeature":true},"Channel Divinity (1/rest)|Cleric||2","Channel Divinity: Harness Divine Power|Cleric||2|UAClassFeatureVariants","Channel Divinity: Harness Divine Power|Cleric||2|TCE",{"classFeature":"Divine Domain feature|Cleric||2","gainSubclassFeature":true},"Ability Score Improvement|Cleric||4","Proficiency Versatility|Cleric||4|UAClassFeatureVariants","Cantrip Versatility|Cleric||4|TCE","Destroy Undead (CR 1/2)|Cleric||5","Channel Divinity (2/rest)|Cleric||6",{"classFeature":"Divine Domain feature|Cleric||6","gainSubclassFeature":true},"Ability Score Improvement|Cleric||8","Proficiency Versatility|Cleric||8|UAClassFeatureVariants","Destroy Undead (CR 1)|Cleric||8",{"classFeature":"Divine Domain feature|Cleric||8","gainSubclassFeature":true},"Divine Intervention|Cleric||10","Destroy Undead (CR 2)|Cleric||11","Ability Score Improvement|Cleric||12","Proficiency Versatility|Cleric||12|UAClassFeatureVariants","Destroy Undead (CR 3)|Cleric||14","Ability Score Improvement|Cleric||16","Proficiency Versatility|Cleric||16|UAClassFeatureVariants","Destroy Undead (CR 4)|Cleric||17",{"classFeature":"Divine Domain feature|Cleric||17","gainSubclassFeature":true},"Channel Divinity (3/rest)|Cleric||18","Ability Score Improvement|Cleric||19","Proficiency Versatility|Cleric||19|UAClassFeatureVariants","Divine Intervention Improvement|Cleric||20"],"subclassTitle":"Divine Domain","subclasses":[{"name":"Life Domain","shortName":"Life","source":"PHB","page":60,"srd":true,"additionalSpells":[{"prepared":{"1":["bless","cure wounds"],"3":["lesser restoration","spiritual weapon"],"5":["beacon of hope","revivify"],"7":["death ward","guardian of faith"],"9":["mass cure wounds","raise dead"]}}],"subclassFeatures":["Life Domain|Cleric||Life||1","Channel Divinity: Preserve Life|Cleric||Life||2","Blessed Healer|Cleric||Life||6","Divine Strike|Cleric||Life||8","Blessed Strikes|Cleric||Life||8|UAClassFeatureVariants","Blessed Strikes|Cleric||Life||8|TCE","Supreme Healing|Cleric||Life||17"]}],"fluff":[{"name":"Cleric","type":"section","entries":["Arms and eyes upraised toward the sun and a prayer on his lips, an elf begins to glow with an inner light that spills out to heal his battle-worn companions.","Chanting a song of glory, a dwarf swings his axe in wide swaths to cut through the ranks of orcs arrayed against him, shouting praise to the gods with every foe's fall.","Calling down a curse upon the forces of undeath, a human lifts her holy symbol as light pours from it to drive back the zombies crowding in on her companions.","Clerics are intermediaries between the mortal world and the distant planes of the gods. As varied as the gods they serve, clerics strive to embody the handiwork of their deities. No ordinary priest, a cleric is imbued with divine magic.",{"type":"entries","name":"Healers and Warriors","entries":["Divine magic, as the name suggests, is the power of the gods, flowing from them into the world. Clerics are conduits for that power, manifesting it as miraculous effects. The gods don't grant this power to everyone who seeks it, but only to those chosen to fulfill a high calling.","Harnessing divine magic doesn't rely on study or training. A cleric might learn formulaic prayers and ancient rites, but the ability to cast cleric spells relies on devotion and an intuitive sense of a deity's wishes.","Clerics combine the helpful magic of healing and inspiring their allies with spells that harm and hinder foes. They can provoke awe and dread, lay curses of plague or poison, and even call down flames from heaven to consume their enemies. For those evildoers who will benefit most from a mace to the head, clerics depend on their combat training to let them wade into melee with the power of the gods on their side."]},{"type":"entries","name":"Divine Agents","entries":["Not every acolyte or officiant at a temple or shrine is a cleric. Some priests are called to a simple life of temple service, carrying out their gods' will through prayer and sacrifice, not by magic and strength of arms. In some cities, priesthood amounts to a political office, viewed as a stepping stone to higher positions of authority and involving no communion with a god at all. True clerics are rare in most hierarchies.","When a cleric takes up an adventuring life, it is usually because his or her god demands it. Pursuing the goals of the gods often involves braving dangers beyond the walls of civilization, smiting evil or seeking holy relics in ancient tombs. Many clerics are also expected to protect their deities' worshipers, which can mean fighting rampaging orcs, negotiating peace between warring nations, or sealing a portal that would allow a demon prince to enter the world.","Most adventuring clerics maintain some connection to established temples and orders of their faiths. A temple might ask for a cleric's aid, or a high priest might be in a position to demand it."]},{"type":"entries","name":"Creating a Cleric","entries":["As you create a cleric, the most important question to consider is which deity to serve and what principles you want your character to embody. Appendix B includes lists of many of the gods of the multiverse. Check with your DM to learn which deities are in your campaign.","Once you've chosen a deity, consider your cleric's relationship to that god. Did you enter this service willingly? Or did the god choose you, impelling you into service with no regard for your wishes? How do the temple priests of your faith regard you: as a champion or a troublemaker? What are your ultimate goals? Does your deity have a special task in mind for you? Or are you striving to prove yourself worthy of a great quest?",{"type":"entries","name":"Quick Build","entries":["You can make a cleric quickly by following these suggestions. First, Wisdom should be your highest ability score, followed by Strength or Constitution. Second, choose the {@background acolyte} background."]}]}],"source":"PHB","page":56},{"type":"section","entries":[{"type":"quote","entries":["To become a cleric is to become a messenger of the gods. The power the divine offers is great, but it always comes with tremendous responsibility."],"by":"Riggby the patriarch"},"Almost all the folk in the world who revere a deity live their lives without ever being directly touched by a divine being. As such, they can never know what it feels like to be a cleric—someone who is not only a devout worshiper, but who has also been invested with a measure of a deity's power.","The question has long been debated: Does a mortal become a cleric as a consequence of deep devotion to one's deity, thereby attracting the god's favor? Or is it the deity who sees the potential in a person and calls that individual into service? Ultimately, perhaps, the answer doesn't matter. However clerics come into being, the world needs clerics as much as clerics and deities need each other.","If you're playing a cleric character, the following sections offer ways to add some detail to that character's history and personality.",{"type":"entries","name":"Temple","entries":["Most clerics start their lives of service as priests in an order, then later realize that they have been blessed by their god with the qualities needed to become a cleric. To prepare for this new duty, candidates typically receive instruction from a cleric of a temple or another place of study devoted to their deity.","Some temples are cut off from the world so that their occupants can focus on devotions, while other temples open their doors to minister to and heal the masses. What is noteworthy about the temple you studied at?",{"type":"table","caption":"Temple","colLabels":["{@dice d6}","Temple"],"colStyles":["col-1 text-center","col-11"],"rows":[[{"type":"cell","roll":{"exact":1}},"Your temple is said to be the oldest surviving structure built to honor your god."],[{"type":"cell","roll":{"exact":2}},"Acolytes of several like-minded deities all received instruction together in your temple."],[{"type":"cell","roll":{"exact":3}},"You come from a temple famed for the brewery it operates. Some say you smell like one of its ales."],[{"type":"cell","roll":{"exact":4}},"Your temple is a fortress and a proving ground that trains warrior-priests."],[{"type":"cell","roll":{"exact":5}},"Your temple is a peaceful, humble place, filled with vegetable gardens and simple priests."],[{"type":"cell","roll":{"exact":6}},"You served in a temple in the Outer Planes."]]},{"type":"entries","name":"Keepsake","entries":["Many clerics have items among their personal gear that symbolize their faith, remind them of their vows, or otherwise help to keep them on their chosen paths. Even though such an item is not imbued with divine power, it is vitally important to its owner because of what it represents.",{"type":"table","caption":"Keepsake","colLabels":["{@dice d6}","Keepsake"],"colStyles":["col-1 text-center","col-11"],"rows":[[{"type":"cell","roll":{"exact":1}},"The finger bone of a saint"],[{"type":"cell","roll":{"exact":2}},"A metal-bound book that tells how to hunt and destroy infernal creatures"],[{"type":"cell","roll":{"exact":3}},"A pig's whistle that reminds you of your humble and beloved mentor"],[{"type":"cell","roll":{"exact":4}},"A braid of hair woven from the tail of a unicorn"],[{"type":"cell","roll":{"exact":5}},"A scroll that describes how best to rid the world of necromancers"],[{"type":"cell","roll":{"exact":6}},"A runestone said to be blessed by your god"]]}]},{"type":"entries","name":"Secret","entries":["No mortal soul is entirely free of second thoughts or doubt. Even a cleric must grapple with dark desires or the forbidden attraction of turning against the teachings of one's deity.","If you haven't considered this aspect of your character yet, see the table entries for some possibilities, or use them for inspiration. Your deep, dark secret might involve something you did (or are doing), or it could be rooted in the way you feel about the world and your role in it.",{"type":"table","caption":"Secret","colLabels":["{@dice d6}","Secret"],"colStyles":["col-1 text-center","col-11"],"rows":[[{"type":"cell","roll":{"exact":1}},"An imp offers you counsel. You try to ignore the creature, but sometimes its advice is helpful."],[{"type":"cell","roll":{"exact":2}},"You believe that, in the final analysis, the gods are nothing more than ultrapowerful mortal creatures."],[{"type":"cell","roll":{"exact":3}},"You acknowledge the power of the gods, but you think that most events are dictated by pure chance."],[{"type":"cell","roll":{"exact":4}},"Even though you can work divine magic, you have never truly felt the presence of a divine essence within yourself."],[{"type":"cell","roll":{"exact":5}},"You are plagued by nightmares that you believe are sent by your god as punishment for some unknown transgression."],[{"type":"cell","roll":{"exact":6}},"In times of despair, you feel that you are but a plaything of the gods, and you resent their remoteness."]]}]},{"type":"inset","name":"Serving a Pantheon, Philosophy, or Force","entries":["The typical cleric is an ordained servant of a particular god and chooses a Divine Domain associated with that deity. The cleric's magic flows from the god or the god's sacred realm, and often the cleric bears a holy symbol that represents that divinity.","Some clerics, especially in a world like Eberron, serve a whole pantheon, rather than a single deity. In certain campaigns, a cleric might instead serve a cosmic force, such as life or death, or a philosophy or concept, such as love, peace, or one of the nine alignments. Chapter 1 of the Dungeon Master's Guide explores options like these, in the section \"Gods of Your World.\"","Talk with your DM about the divine options available in your campaign, whether they're gods, pantheons, philosophies, or cosmic forces. Whatever being or thing your cleric ends up serving, choose a Divine Domain that is appropriate for it, and if it doesn't have a holy symbol, work with your DM to design one.","The cleric's class features often refer to your deity. If you are devoted to a pantheon, cosmic force, or philosophy, your cleric features still work for you as written. Think of the references to a god as references to the divine thing you serve that gives you your magic."]}]}],"source":"XGE","page":17}]},"classFeature":[{"name":"Divine Domain","source":"PHB","page":36,"srd":true,"className":"Cleric","classSource":"PHB","level":1,"entries":["Choose one domain related to your deity from the list of available domains. Each domain is detailed in their own feature, and each one provides examples of gods associated with it. Your choice grants you domain spells and other features when you choose it at 1st level. It also grants you additional ways to use Channel Divinity when you gain that feature at 2nd level, and additional benefits at 6th, 8th, and 17th levels.",{"type":"entries","name":"Domain Spells","entries":["Each domain has a list of spells—its domain spells—that you gain at the cleric levels noted in the domain description. Once you gain a domain spell, you always have it prepared, and it doesn't count against the number of spells you can prepare each day.","If you have a domain spell that doesn't appear on the cleric spell list, the spell is nonetheless a cleric spell for you."]}]},{"name":"Spellcasting","source":"PHB","page":36,"srd":true,"className":"Cleric","classSource":"PHB","level":1,"entries":["As a conduit for divine power, you can cast cleric spells. See {@book chapter 10|PHB|10} for the general rules of spellcasting and {@book chapter 11|PHB|11} for a selection of {@filter cleric spells|spells|class=cleric}.",{"type":"entries","name":"Cantrips","entries":["At 1st level, you know three cantrips of your choice from the cleric spell list. You learn additional cleric cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Cleric table."]},{"type":"entries","name":"Preparing and Casting Spells","entries":["The Cleric table shows how many spell slots you have to cast your {@filter cleric spells|spells|class=cleric} of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.","You prepare the list of cleric spells that are available for you to cast, choosing from the cleric spell list. When you do so, choose a number of cleric spells equal to your Wisdom modifier + your cleric level (minimum of one spell). The spells must be of a level for which you have spell slots.","For example, if you are a 3rd-level cleric, you have four 1st-level and two 2nd-level spell slots. With a Wisdom of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell {@spell cure wounds}, you can cast it using a 1st-level or 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.","You can change your list of prepared spells when you finish a long rest. Preparing a new list of cleric spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list."]},{"type":"entries","name":"Spellcasting Ability","entries":["Wisdom is your spellcasting ability for your cleric spells. The power of your spells comes from your devotion to your deity. You use your Wisdom whenever a cleric spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a cleric spell you cast and when making an attack roll with one.",{"type":"abilityDc","name":"Spell","attributes":["wis"]},{"type":"abilityAttackMod","name":"Spell","attributes":["wis"]}]},{"type":"entries","name":"Ritual Casting","entries":["You can cast a cleric spell as a ritual if that spell has the ritual tag and you have the spell prepared."]},{"type":"entries","name":"Spellcasting Focus","entries":["You can use a {@item holy symbol|phb} as a spellcasting focus for your cleric spells."]}]},{"name":"Channel Divinity (1/rest)","source":"PHB","page":36,"srd":true,"className":"Cleric","classSource":"PHB","level":2,"entries":["At 2nd level, you gain the ability to channel divine energy directly from your deity, using that energy to fuel magical effects. You start with two such effects: Turn Undead and an effect determined by your domain. Some domains grant you additional effects as you advance in levels, as noted in the domain description.","When you use your Channel Divinity, you choose which effect to create. You must then finish a short or long rest to use your Channel Divinity again.","Some Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your cleric spell save DC.","Beginning at 6th level, you can use your Channel Divinity twice between rests, and beginning at 18th level, you can use it three times between rests. When you finish a short or long rest, you regain your expended uses.",{"type":"refClassFeature","classFeature":"Turn Undead|Cleric||2"}]},{"name":"Divine Domain feature","source":"PHB","page":36,"srd":true,"className":"Cleric","classSource":"PHB","level":2,"entries":["At 2nd level, you gain a feature from your Divine Domain."]},{"name":"Turn Undead","source":"PHB","page":36,"srd":true,"className":"Cleric","classSource":"PHB","level":2,"header":2,"entries":["As an action, you present your holy symbol and speak a prayer censuring the undead. Each undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes any damage.","A turned creature must spend its turns trying to move as far away from you as it can, and it can't willingly move to a space within 30 feet of you. It also can't take reactions. For its action, it can use only the {@action Dash} action or try to escape from an effect that prevents it from moving. If there's nowhere to move, the creature can use the {@action Dodge} action."]},{"name":"Ability Score Improvement","source":"PHB","page":36,"srd":true,"className":"Cleric","classSource":"PHB","level":4,"entries":["When you reach 4th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.","If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."]},{"name":"Destroy Undead (CR 1/2)","source":"PHB","page":36,"srd":true,"className":"Cleric","classSource":"PHB","level":5,"entries":["Starting at 5th level, when an {@filter undead of CR 1/2 or lower|bestiary|challenge rating=[&0;&1/2]|type=undead|miscellaneous=!swarm} fails its saving throw against your Turn Undead feature, the creature is instantly destroyed."]},{"name":"Channel Divinity (2/rest)","source":"PHB","page":36,"srd":true,"className":"Cleric","classSource":"PHB","level":6,"entries":["Beginning at 6th level, you can use your Channel Divinity twice between rests."]},{"name":"Divine Domain feature","source":"PHB","page":36,"srd":true,"className":"Cleric","classSource":"PHB","level":6,"entries":["At 6th level, you gain a feature from your Divine Domain."]},{"name":"Ability Score Improvement","source":"PHB","page":36,"srd":true,"className":"Cleric","classSource":"PHB","level":8,"entries":["When you reach 8th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.","If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."]},{"name":"Destroy Undead (CR 1)","source":"PHB","page":36,"srd":true,"className":"Cleric","classSource":"PHB","level":8,"entries":["Starting at 8th level, when an {@filter undead of CR 1 or lower|bestiary|challenge rating=[&0;&1]|type=undead|miscellaneous=!swarm} fails its saving throw against your Turn Undead feature, the creature is instantly destroyed."]},{"name":"Divine Domain feature","source":"PHB","page":36,"srd":true,"className":"Cleric","classSource":"PHB","level":8,"entries":["At 8th level, you gain a feature from your Divine Domain."]},{"name":"Divine Intervention","source":"PHB","page":36,"srd":true,"className":"Cleric","classSource":"PHB","level":10,"entries":["Beginning at 10th level, you can call on your deity to intervene on your behalf when your need is great.","Imploring your deity's aid requires you to use your action. Describe the assistance you seek, and roll percentile dice. If you roll a number equal to or lower than your cleric level, your deity intervenes. The DM chooses the nature of the intervention; the effect of any cleric spell or cleric domain spell would be appropriate. If your deity intervenes, you can't use this feature again for 7 days. Otherwise, you can use it again after you finish a long rest.","At 20th level, your call for intervention succeeds automatically, no roll required."]},{"name":"Destroy Undead (CR 2)","source":"PHB","page":36,"srd":true,"className":"Cleric","classSource":"PHB","level":11,"entries":["Starting at 11th level, when an {@filter undead of CR 2 or lower|bestiary|challenge rating=[&0;&2]|type=undead|miscellaneous=!swarm} or lower fails its saving throw against your Turn Undead feature, the creature is instantly destroyed."]},{"name":"Ability Score Improvement","source":"PHB","page":36,"srd":true,"className":"Cleric","classSource":"PHB","level":12,"entries":["When you reach 12th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.","If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."]},{"name":"Destroy Undead (CR 3)","source":"PHB","page":36,"srd":true,"className":"Cleric","classSource":"PHB","level":14,"entries":["Starting at 14th level, when an {@filter undead of CR 3 or lower|bestiary|challenge rating=[&0;&3]|type=undead|miscellaneous=!swarm} fails its saving throw against your Turn Undead feature, the creature is instantly destroyed."]},{"name":"Ability Score Improvement","source":"PHB","page":36,"srd":true,"className":"Cleric","classSource":"PHB","level":16,"entries":["When you reach 16th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.","If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."]},{"name":"Destroy Undead (CR 4)","source":"PHB","page":36,"srd":true,"className":"Cleric","classSource":"PHB","level":17,"entries":["Starting at 17th level, when an {@filter undead of CR 4 or lower|bestiary|challenge rating=[&0;&4]|type=undead|miscellaneous=!swarm} fails its saving throw against your Turn Undead feature, the creature is instantly destroyed."]},{"name":"Divine Domain feature","source":"PHB","page":36,"srd":true,"className":"Cleric","classSource":"PHB","level":17,"entries":["At 17th level, you gain a feature from your Divine Domain."]},{"name":"Channel Divinity (3/rest)","source":"PHB","page":36,"srd":true,"className":"Cleric","classSource":"PHB","level":18,"entries":["Beginning at 18th level, you can use your Channel Divinity three times between rests."]},{"name":"Ability Score Improvement","source":"PHB","page":36,"srd":true,"className":"Cleric","classSource":"PHB","level":19,"entries":["When you reach 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.","If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."]},{"name":"Divine Intervention Improvement","source":"PHB","page":36,"srd":true,"className":"Cleric","classSource":"PHB","level":20,"entries":["At 20th level, your call for intervention succeeds automatically, no roll required."]}],"subclassFeature":[{"name":"Life Domain","source":"PHB","page":60,"srd":true,"className":"Cleric","classSource":"PHB","subclassShortName":"Life","subclassSource":"PHB","level":1,"entries":["The Life domain focuses on the vibrant positive energy—one of the fundamental forces of the universe—that sustains all life. The gods of life promote vitality and health through healing the sick and wounded, caring for those in need, and driving away the forces of death and undeath. Almost any non-evil deity can claim influence over this domain, particularly agricultural deities (such as Chauntea, Arawai, and Demeter), sun gods (such as Lathander, Pelor, and Re-Horakhty), gods of healing or endurance (such as Ilmater, Mishakal, Apollo, and Diancecht), and gods of home and community (such as Hestia, Hathor, and Boldrei).","At each indicated cleric level, you add the listed spells to your spells prepared.",{"type":"table","caption":"Life Domain Spells","colLabels":["Cleric Level","Spells"],"colStyles":["col-2 text-center","col-10"],"rows":[["1st","{@spell bless}, {@spell cure wounds}"],["3rd","{@spell lesser restoration}, {@spell spiritual weapon}"],["5th","{@spell beacon of hope}, {@spell revivify}"],["7th","{@spell death ward}, {@spell guardian of faith}"],["9th","{@spell mass cure wounds}, {@spell raise dead}"]]},{"type":"refSubclassFeature","subclassFeature":"Bonus Proficiency|Cleric||Life||1"},{"type":"refSubclassFeature","subclassFeature":"Disciple of Life|Cleric||Life||1"}]},{"name":"Bonus Proficiency","source":"PHB","page":60,"srd":true,"className":"Cleric","classSource":"PHB","subclassShortName":"Life","subclassSource":"PHB","level":1,"header":1,"entries":["When you choose this domain at 1st level, you gain proficiency with heavy armor."]},{"name":"Disciple of Life","source":"PHB","page":60,"srd":true,"className":"Cleric","classSource":"PHB","subclassShortName":"Life","subclassSource":"PHB","level":1,"header":1,"entries":["Also starting at 1st level, your healing spells are more effective. Whenever you use a spell of 1st level or higher to restore hit points to a creature, the creature regains additional hit points equal to 2 + the spell's level."]},{"name":"Channel Divinity: Preserve Life","source":"PHB","page":60,"srd":true,"className":"Cleric","classSource":"PHB","subclassShortName":"Life","subclassSource":"PHB","level":2,"header":2,"entries":["Starting at 2nd level, you can use your Channel Divinity to heal the badly injured.","As an action, you present your holy symbol and evoke healing energy that can restore a number of hit points equal to five times your cleric level. Choose any creatures within 30 feet of you, and divide those hit points among them. This feature can restore a creature to no more than half of its hit point maximum. You can't use this feature on an undead or a construct."]},{"name":"Blessed Healer","source":"PHB","page":60,"srd":true,"className":"Cleric","classSource":"PHB","subclassShortName":"Life","subclassSource":"PHB","level":6,"header":2,"entries":["Beginning at 6th level, the healing spells you cast on others heal you as well. When you cast a spell of 1st level or higher that restores hit points to a creature other than you, you regain hit points equal to 2 + the spell's level."]},{"name":"Divine Strike","source":"PHB","page":60,"srd":true,"className":"Cleric","classSource":"PHB","subclassShortName":"Life","subclassSource":"PHB","level":8,"header":2,"entries":["At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra {@damage 1d8} radiant damage to the target. When you reach 14th level, the extra damage increases to {@dice 2d8}."]},{"name":"Supreme Healing","source":"PHB","page":60,"srd":true,"className":"Cleric","classSource":"PHB","subclassShortName":"Life","subclassSource":"PHB","level":17,"header":2,"entries":["Starting at 17th level, when you would normally roll one or more dice to restore hit points with a spell, you instead use the highest number possible for each die. For example, instead of restoring {@dice 2d6} hit points to a creature, you restore 12."]}]}